# Business Understanding

## Business Problem

# Data Understanding

# Exploratory Data Analysis

# Conclusion

# Recomentations

# Next Steps

# More Information

In [60]:
# Bringing in the libraries I will use for this project
import pandas as pd
import numpy as np
import sqlite3

In [61]:
# Now let's go for the database file
import zipfile

In [62]:
import os
os.chdir("\Data")

In [63]:
conn = sqlite3.connect(r'C:\Users\us\Documents\DT Flatiron Flex Course\phase_1\Microsoft_Film_Proposal\Data\im.db')

In [64]:
sql_tables = """
select name
from sqlite_master
where type='table'
"""

In [65]:
! dir

 Volume in drive C has no label.
 Volume Serial Number is 5CDE-0ED8

 Directory of C:\Data

01/25/2023  12:53 PM    <DIR>          .
01/25/2023  12:53 PM    <DIR>          ..
01/05/2023  07:02 PM    <DIR>          db
01/17/2023  08:26 PM                 0 im.db
01/25/2023  12:53 PM                 0 movies.db
               2 File(s)              0 bytes
               3 Dir(s)  329,289,363,456 bytes free

In [66]:
pd.read_sql(sql_tables, conn)

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [67]:
# Load the tables
directors = pd.read_sql("SELECT * FROM directors", conn)
known_for = pd.read_sql("SELECT * FROM known_for", conn)
movie_akas = pd.read_sql_query("SELECT * FROM movie_akas", conn)
movie_basics = pd.read_sql_query("SELECT * FROM movie_basics", conn)
movie_ratings = pd.read_sql_query("SELECT * FROM movie_ratings", conn)
persons = pd.read_sql_query("SELECT * FROM persons", conn)
principals = pd.read_sql_query("SELECT * FROM principals", conn)
writers = pd.read_sql_query("SELECT * FROM writers", conn)

In [68]:
directors.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [33]:
df = pd.read_sql_query("SELECT * FROM directors", conn)

df.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [69]:
# Now lets take a look at all the tables
directors.head()
known_for.head()
movie_akas.head()
movie_basics.head()
movie_ratings.head()
persons.head()
principals.head()
writers.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087

In [80]:
df = pd.read_sql_query("SELECT * FROM movie_basics", conn)

df.head()

DatabaseError: Execution failed on sql 'SELECT * FROM movie_basics': no such table: movie_basics

In [81]:
movie_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [82]:
import sqlite3

connection = sqlite3.connect("movies.db")
cursor = connection.cursor()

query = "SELECT * FROM movie_basics JOIN directors ON movie_basics.director_id = directors.director_id JOIN known_for ON movie_basics.known_for_id = known_for.known_for_id JOIN movie_akas ON movie_basics.movie_akas_id = movie_akas.movie_akas_id JOIN movie_ratings ON movie_basics.movie_ratings_id = movie_ratings.movie_ratings_id JOIN persons ON movie_basics.persons_id = persons.persons_id JOIN principals ON movie_basics.principals_id = principals.principals_id JOIN writers ON movie_basics.writers_id = writers.writers_id"
cursor.execute(query)
result = cursor.fetchall()

for row in result:
    print(row)

connection.close()

OperationalError: no such table: movie_basics

In [83]:
import sqlite3
conn = sqlite3.connect('movies.db')

In [84]:
import pandas as pd

movie_basics = pd.read_sql_query("SELECT * FROM movie_basics", conn)
directors = pd.read_sql_query("SELECT * FROM directors", conn)
known_for = pd.read_sql_query("SELECT * FROM known_for", conn)
movie_akas = pd.read_sql_query("SELECT * FROM movie_akas", conn)
movie_ratings = pd.read_sql_query("SELECT * FROM movie_ratings", conn)
persons = pd.read_sql_query("SELECT * FROM persons", conn)
principals = pd.read_sql_query("SELECT * FROM principals", conn)
writers = pd.read_sql_query("SELECT * FROM writers", conn)

#join all the tables
df = movie_basics.merge(directors, on='director_id', how='left')
df = df.merge(known_for, on='known_for_id', how='left')
df = df.merge(movie_akas, on='movie_akas_id', how='left')
df = df.merge(movie_ratings, on='movie_ratings_id', how='left')
df = df.merge(persons, on='persons_id', how='left')
df = df.merge(principals, on='principals_id', how='left')
df = df.merge(writers, on='writers_id', how='left')

print(df)

DatabaseError: Execution failed on sql 'SELECT * FROM movie_basics': no such table: movie_basics

In [74]:
movie_basics.head(146144)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [75]:
movie_ratings.head(73856)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [76]:
pd.read_sql("""
SELECT *
FROM movie_ratings
ORDER BY average_rating DESC
LIMIT 25;
""", conn)

DatabaseError: Execution failed on sql '
SELECT *
FROM movie_ratings
ORDER BY average_rating DESC
LIMIT 25;
': no such table: movie_ratings

In [77]:
import sqlite3

connection = sqlite3.connect("movies.db")
cursor = connection.cursor()

query = "SELECT * FROM movie_ratings ORDER BY average_rating DESC LIMIT 25"
cursor.execute(query)
result = cursor.fetchall()

for row in result:
    print(row)

connection.close()

OperationalError: no such table: movie_ratings

In [78]:
import pandas as pd

df = pd.read_sql_query("SELECT * FROM movie_ratings ORDER BY average_rating DESC LIMIT 25", conn)
print(df)

DatabaseError: Execution failed on sql 'SELECT * FROM movie_ratings ORDER BY average_rating DESC LIMIT 25': no such table: movie_ratings